#### Terraform Path: `applications/kratos`
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/ory-dev/kratos/runs/run-xrggMnbA6kWTZ3yn

Waiting for the plan to start...

Terraform v1.4.4
on linux_amd64
Initializing plugins and modules...
data.aws_ssm_parameter.database_info: Refreshing...
data.aws_ssm_parameter.cluster_info: Refreshing...
data.aws_route53_zone.domain: Refreshing...
data.aws_secretsmanager_secret.db_user_password: Refreshing...
data.aws_ssm_parameter.network_info: Refreshing...
data.aws_ssm_parameter.cluster_info: Refresh complete after 0s [id=/ory-dev/ory/dev/cluster/info]
data.aws_ssm_parameter.network_info: Refresh complete after 0s [id=/ory-dev/ory/dev/network/info]
data.aws_ssm_parameter.database_info: Refresh complete after 0s [id=/ory-dev/ory/dev/database/info]
data.aws_secretsmanager_secret.db_user_password: Refresh complete after 0s [id=arn:aws:secretsmanager:us-east-1:182402351974:secret:/ory-dev/ory/dev/database/user/kratos/password-CGCoYe]
data.aws_secretsmanager_secret_version.db_user_password: Refreshing...
data.aws_secretsmanager_secret_version.db_user_password: Refresh complete after 0s [id=arn:aws:secretsmanager:us-east-1:182402351974:secret:/ory-dev/ory/dev/database/user/kratos/password-CGCoYe|AWSCURRENT]
data.aws_route53_zone.domain: Refresh complete after 1s [id=Z1628L9AMRQ4DO]
╷
│ Warning: Value for undeclared variable
│
│ The root module does not declare a variable named
│ "cidr_allow_list_parameter" but a value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-xrggMnbA6kWTZ3yn/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_acm_certificate.cert will be created
  + resource "aws_acm_certificate" "cert" {
      + arn                       = (known after apply)
      + domain_name               = "auth.dev.wantsmore.coffee"
      + domain_validation_options = [
          + {
              + domain_name           = "auth.dev.wantsmore.coffee"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "auth.dev.wantsmore.coffee",
        ]
      + tags_all                  = {
          + "Environment"  = "dev"
          + "ManagedBy"    = "Terraform Cloud"
          + "Organization" = "ory-dev"
          + "Project"      = "ory"
          + "Repository"   = "keenan-v1/ory-example"
          + "Workspace"    = "kratos"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # aws_acm_certificate_validation.cert_validation will be created
  + resource "aws_acm_certificate_validation" "cert_validation" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_autoscaling_attachment.asg_to_alb[0] will be created
  + resource "aws_autoscaling_attachment" "asg_to_alb" {
      + autoscaling_group_name = (sensitive value)
      + id                     = (known after apply)
      + lb_target_group_arn    = (known after apply)
    }

  # aws_autoscaling_attachment.asg_to_alb[1] will be created
  + resource "aws_autoscaling_attachment" "asg_to_alb" {
      + autoscaling_group_name = (sensitive value)
      + id                     = (known after apply)
      + lb_target_group_arn    = (known after apply)
    }

  # aws_cloudwatch_log_group.log will be created
  + resource "aws_cloudwatch_log_group" "log" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/ory-dev/ory/dev/ecs/service/kratos"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags_all          = {
          + "Environment"  = "dev"
          + "ManagedBy"    = "Terraform Cloud"
          + "Organization" = "ory-dev"
          + "Project"      = "ory"
          + "Repository"   = "keenan-v1/ory-example"
          + "Workspace"    = "kratos"
        }
    }

  # aws_ecs_service.service will be created
  + resource "aws_ecs_service" "service" {
      + cluster                            = (sensitive value)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = (known after apply)
      + name                               = "kratos"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = {
          + "Environment"  = "dev"
          + "ManagedBy"    = "Terraform Cloud"
          + "Organization" = "ory-dev"
          + "Project"      = "ory"
          + "Repository"   = "keenan-v1/ory-example"
          + "Workspace"    = "kratos"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "kratos"
          + container_port   = 4433
          + target_group_arn = (known after apply)
        }
      + load_balancer {
          + container_name   = "kratos"
          + container_port   = 4434
          + target_group_arn = (known after apply)
        }
    }

  # aws_ecs_task_definition.service will be created
  + resource "aws_ecs_task_definition" "service" {
      + arn                   = (known after apply)
      + arn_without_revision  = (known after apply)
      + container_definitions = (known after apply)
      + family                = "kratos"
      + id                    = (known after apply)
      + network_mode          = (known after apply)
      + revision              = (known after apply)
      + skip_destroy          = false
      + tags_all              = {
          + "Environment"  = "dev"
          + "ManagedBy"    = "Terraform Cloud"
          + "Organization" = "ory-dev"
          + "Project"      = "ory"
          + "Repository"   = "keenan-v1/ory-example"
          + "Workspace"    = "kratos"
        }
    }

  # aws_route53_record.cert_validation["auth.dev.wantsmore.coffee"] will be created
  + resource "aws_route53_record" "cert_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z1628L9AMRQ4DO"
    }

  # aws_secretsmanager_secret.application_secrets will be created
  + resource "aws_secretsmanager_secret" "application_secrets" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "/ory-dev/ory/dev/application/kratos"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + rotation_enabled               = (known after apply)
      + rotation_lambda_arn            = (known after apply)
      + tags_all                       = {
          + "Environment"  = "dev"
          + "ManagedBy"    = "Terraform Cloud"
          + "Organization" = "ory-dev"
          + "Project"      = "ory"
          + "Repository"   = "keenan-v1/ory-example"
          + "Workspace"    = "kratos"
        }
    }

  # aws_secretsmanager_secret_version.application_secrets will be created
  + resource "aws_secretsmanager_secret_version" "application_secrets" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # random_password.application_secrets[0] will be created
  + resource "random_password" "application_secrets" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 32
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "_%@"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # random_password.application_secrets[1] will be created
  + resource "random_password" "application_secrets" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 32
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "_%@"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # random_password.application_secrets[2] will be created
  + resource "random_password" "application_secrets" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 32
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "_%@"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.alb.aws_lb.this[0] will be created
  + resource "aws_lb" "this" {
      + arn                                         = (known after apply)
      + arn_suffix                                  = (known after apply)
      + desync_mitigation_mode                      = "defensive"
      + dns_name                                    = (known after apply)
      + drop_invalid_header_fields                  = false
      + enable_deletion_protection                  = false
      + enable_http2                                = true
      + enable_tls_version_and_cipher_suite_headers = false
      + enable_waf_fail_open                        = false
      + enable_xff_client_port                      = true
      + id                                          = (known after apply)
      + idle_timeout                                = 60
      + internal                                    = false
      + ip_address_type                             = "ipv4"
      + load_balancer_type                          = "application"
      + name                                        = "ory-dev-alb"
      + preserve_host_header                        = false
      + security_groups                             = (known after apply)
      + subnets                                     = (sensitive value)
      + tags                                        = {
          + "Name" = "ory-dev-alb"
        }
      + tags_all                                    = {
          + "Environment"  = "dev"
          + "ManagedBy"    = "Terraform Cloud"
          + "Name"         = "ory-dev-alb"
          + "Organization" = "ory-dev"
          + "Project"      = "ory"
          + "Repository"   = "keenan-v1/ory-example"
          + "Workspace"    = "kratos"
        }
      + vpc_id                                      = (known after apply)
      + xff_header_processing_mode                  = "append"
      + zone_id                                     = (known after apply)

      + timeouts {
          + create = "10m"
          + delete = "10m"
          + update = "10m"
        }
    }

  # module.alb.aws_lb_listener.frontend_http_tcp[0] will be created
  + resource "aws_lb_listener" "frontend_http_tcp" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = {
          + "Environment"  = "dev"
          + "ManagedBy"    = "Terraform Cloud"
          + "Organization" = "ory-dev"
          + "Project"      = "ory"
          + "Repository"   = "keenan-v1/ory-example"
          + "Workspace"    = "kratos"
        }

      + default_action {
          + order = (known after apply)
          + type  = "redirect"

          + redirect {
              + host        = "#{host}"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }
    }

  # module.alb.aws_lb_listener.frontend_https[0] will be created
  + resource "aws_lb_listener" "frontend_https" {
      + arn               = (known after apply)
      + certificate_arn   = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 443
      + protocol          = "HTTPS"
      + ssl_policy        = "ELBSecurityPolicy-2016-08"
      + tags_all          = {
          + "Environment"  = "dev"
          + "ManagedBy"    = "Terraform Cloud"
          + "Organization" = "ory-dev"
          + "Project"      = "ory"
          + "Repository"   = "keenan-v1/ory-example"
          + "Workspace"    = "kratos"
        }

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.alb.aws_lb_listener_rule.https_listener_rule[0] will be created
  + resource "aws_lb_listener_rule" "https_listener_rule" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = 100
      + tags_all     = {
          + "Environment"  = "dev"
          + "ManagedBy"    = "Terraform Cloud"
          + "Organization" = "ory-dev"
          + "Project"      = "ory"
          + "Repository"   = "keenan-v1/ory-example"
          + "Workspace"    = "kratos"
        }

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + path_pattern {
              + values = [
                  + "/admin/*",
                ]
            }
        }
    }

  # module.alb.aws_lb_target_group.main[0] will be created
  + resource "aws_lb_target_group" "main" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "10"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = (known after apply)
      + name_prefix                        = "pub-"
      + port                               = 4433
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name" = "pub-"
        }
      + tags_all                           = {
          + "Environment"  = "dev"
          + "ManagedBy"    = "Terraform Cloud"
          + "Name"         = "pub-"
          + "Organization" = "ory-dev"
          + "Project"      = "ory"
          + "Repository"   = "keenan-v1/ory-example"
          + "Workspace"    = "kratos"
        }
      + target_type                        = "instance"
      + vpc_id                             = (sensitive value)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = "200-399"
          + path                = "/health/alive"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 6
          + unhealthy_threshold = 3
        }
    }

  # module.alb.aws_lb_target_group.main[1] will be created
  + resource "aws_lb_target_group" "main" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "10"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = (known after apply)
      + name_prefix                        = "adm-"
      + port                               = 4434
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name" = "adm-"
        }
      + tags_all                           = {
          + "Environment"  = "dev"
          + "ManagedBy"    = "Terraform Cloud"
          + "Name"         = "adm-"
          + "Organization" = "ory-dev"
          + "Project"      = "ory"
          + "Repository"   = "keenan-v1/ory-example"
          + "Workspace"    = "kratos"
        }
      + target_type                        = "instance"
      + vpc_id                             = (sensitive value)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = "200-399"
          + path                = "/health/alive"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 6
          + unhealthy_threshold = 3
        }
    }

  # module.alb.aws_security_group.this[0] will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "ory-dev-alb-sg-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "ory-dev-alb-sg"
        }
      + tags_all               = {
          + "Environment"  = "dev"
          + "ManagedBy"    = "Terraform Cloud"
          + "Name"         = "ory-dev-alb-sg"
          + "Organization" = "ory-dev"
          + "Project"      = "ory"
          + "Repository"   = "keenan-v1/ory-example"
          + "Workspace"    = "kratos"
        }
      + vpc_id                 = (sensitive value)
    }

  # module.alb.aws_security_group_rule.this["egress_all"] will be created
  + resource "aws_security_group_rule" "this" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.alb.aws_security_group_rule.this["ingress_all_http"] will be created
  + resource "aws_security_group_rule" "this" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "HTTP web traffic"
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # module.alb.aws_security_group_rule.this["ingress_all_https"] will be created
  + resource "aws_security_group_rule" "this" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "HTTPS web traffic"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.alb.aws_security_group_rule.this["ingress_all_icmp"] will be created
  + resource "aws_security_group_rule" "this" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "ICMP"
      + from_port                = -1
      + id                       = (known after apply)
      + protocol                 = "icmp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = -1
      + type                     = "ingress"
    }

Plan: 24 to add, 0 to change, 0 to destroy.

```

</details>

*Pushed by: @keenan-v1, Action: `pull_request`*